{
  "a": 30,
  "c": 31,
  "d": 32,
  "e": 33,
  "f": 34,
  "g": 35,
  "h": 36,
  "i": 37,
  "k": 38,
  "l": 39,
  "m": 40,
  "n": 41,
  "p": 42,
  "q": 43,
  "r": 44,
  "s": 45,
  "t": 46,
  "v": 47,
  "w": 48,
  "y": 49
}
